import 'package:flutter/material.dart';
import 'package:flutter_application_1/domain/entities/book.dart';
import 'package:flutter_application_1/ui/screens/catalog_screen.dart';

const List<BookItem> books = [
  BookItem(
    id: "1",
    previewSrc: "assets/images/parfumer.png",
    name: "Парфюмер. История одного убийцы",
    author: "Патрик Зюскинд",
    year: 1985,
    genres: ["18+", "Драма", "Зарубежное"],
    description: "«Парфюмер. История одного убийцы» — исторический психологический роман о человеке с феноменальным обонянием, который стремится создать аромат, способный подчинять людей. Патрик Зюскинд переносит действие во Францию XVIII века, где парижские улицы, мастерские и рынки существуют прежде всего в запахах: резких, сладких, гнилостных, почти осязаемых. Жан-Батист Гренуй лишён собственного человеческого запаха и отделён от окружающих этой особенностью. Его талант к парфюмерии постепенно превращается в одержимость совершенством.",
    isLike: true,
  ),
  BookItem(
    id: "2",
    previewSrc: "assets/images/death_souls.png",
    name: "Мертвые души",
    author: "Николай Гоголь",
    year: 1842,
    genres: ["16+", "Поэма", "Роман"],
    description: "«...Говоря о „Мертвых душах“, можно вдоволь наговориться о России» — это суждение поэта и критика П. А. Вяземского объясняет особое место поэмы Гоголя в истории русской литературы: и огромный успех у читателей, и необычайную остроту полемики вокруг главной гоголевской книги, и многообразие высказанных мнений, каждое из которых так или иначе вовлекает в размышления о природе национального характера и культурного сознания, о настоящем и будущем России.",
  ),
  BookItem(
    id: "3",
    previewSrc: "assets/images/dorian_gray.png",
    name: "Портрет Дориана Грея",
    author: "Оскар Уайльд",
    year: 1890,
    genres: ["16+", "Роман", "Зарубежное"],
    description: "«Портрет Дориана Грея» — самое знаменитое произведение Оскара Уайльда, единственный его роман, вызвавший в свое время шквал негативных оценок и тем не менее имевший невероятный успех. Главный герой романа, красавец Дориан, — фигура двойственная, неоднозначная. Тонкий эстет и романтик становится безжалостным преступником. Попытка сохранить свою необычайную красоту и молодость оборачивается провалом. Вместо героя стареет его портрет — но это не может продолжаться вечно, и смерть Дориана расставляет все по своим местам. Роман Оскара Уайльда продолжает быть очень актуальным и сегодня — разве погоня за вечной молодостью порой не оборачивается потерей своего истинного лица?",
    isLike: true,
  ),
  BookItem(
    id: "4",
    previewSrc: "assets/images/rose_name.png",
    name: "Имя розы",
    author: "Умберто Эко",
    year: 1980,
    genres: ["18+", "Роман", "Зарубежное"],
    description: "«Имя розы» — философско-детективный роман о расследовании загадочных смертей в бенедиктинском монастыре Северной Италии XIV века. Умберто Эко помещает францисканца Вильгельма Баскервильского и его молодого спутника Адсона Мелькского в замкнутое пространство, где богословский спор соседствует с борьбой за книги и право на знание. Монастырь живёт по строгим правилам, а закрытая библиотека-лабиринт хранит рукописи и тревожные следы прошлого. Средневековая история соединяет детективную интригу, религиозные конфликты и размышления о вере, власти, цензуре и свободе мысли.",
  ),
  BookItem(
    id: "5",
    previewSrc: "assets/images/clean_architecture.png",
    name: "Чистая архитектура. Искусство разработки программного обеспечения",
    author: "Роберт Мартин",
    year: 2017,
    genres: ["12+", "Программирование", "Архитектура программного обеспечения"],
    description: "`Идеальный программист` и `Чистый код` - легендарные бестселлеры Роберта Мартина - рассказывают, как достичь высот профессионализма. `Чистая архитектура` продолжает эту тему, но не предлагает несколько вариантов в стиле `решай сам`, а объясняет, что именно следует делать, по какой причине и почему именно такое решение станет принципиально важным для вашего успеха. Роберт Мартин дает прямые и лаконичные ответы на ключевые вопросы архитектуры и дизайна. `Чистую архитектуру` обязаны прочитать разработчики всех уровней, системные аналитики, архитекторы и каждый программист, который желает подняться по карьерной лестнице или хотя бы повлиять на людей, которые занимаются данной работой. Все архитектуры подчиняются одним и тем же правилам! Роберт Мартин (дядюшка Боб)",
  ),
  BookItem(
    id: "6",
    previewSrc: "assets/images/highload_architecture.png",
    name: "Высоконагруженные приложения. Программирование, масштабирование, поддержка",
    author: "Клеппман Мартин",
    year: 2017,
    genres: [
      "16+",
      "Программирование",
      "Архитектура программного обеспечения",
      "Базы данных и распределенные системы",
    ],
    description: "В этой книге вы найдете ключевые принципы, алгоритмы и компромиссы, без которых не обойтись при разработке высоконагруженных систем для работы с данными. Материал рассматривается на примере внутреннего устройства популярных программных пакетов и фреймворков. В книге три основные части, посвященные, прежде всего, теоретическим аспектам работы с распределенными системами и базами данных. От читателя требуются базовые знания SQL и принципов работы баз данных.",
    isLike: true,
  ),
  BookItem(
    id: "7",
    previewSrc: "assets/images/catalog_lature.png",
    name: "Каталог Латура, или Лакей маркиза де Сада",
    author: "Николай Фробениус",
    year: 2004,
    genres: ["18+", "Мистика"],
    description: "Николай Фробениус - известный норвежский писатель и сценарист. На русский язык переведены такие его романы, как `Адская притча`, `Другие места`, `Застенчивый порнограф`. Всемирную известность принесла писателю книга `Каталог Латура`, которую критики неизменно сравнивают с `Парфюмером` Патрика Зюскинда. События романа разворачиваются во Франции XVIII века. Главный герой, слуга маркиза де Сада, с рождения лишенный чувствительности к боли, посвящает себя анатомии, чтобы найти в человеческом мозге центр боли.",
  ),
  BookItem(
    id: "8",
    previewSrc: "assets/images/fahrenheit_451.png",
    name: "451 градус по Фаренгейту",
    author: "Рэй Брэдбери",
    year: 1953,
    genres: ["16+", "Научная фантастика", "Философский роман"],
    description: "451 градус по Фаренгейту. Книга для чтения на английском языке. Повесть знаменитого американского писателя-фантаста «451 градус по Фаренгейту» написана более полувека назад, но своей актуальности не потеряла и по сей день. Ее лейтмотив - озабоченность духовным обликом будущего. Будущее, как его видел Бредбери, довольно мрачно: тоталитарное государство, в котором пресекается любое инакомыслие. Реклама, бесконечные телешоу - вот и все, что нужно человеку для безмятежного счастья. Так решило государство, и оно защищает своих граждан в меру собственного разумения: разговаривать друг с другом - значит думать, думать заставляют книги, поэтому, дабы не нарушать покоя обывателей, их надлежит сжигать. 451 градус по Фаренгейту - это температура горения бумаги. Предлагаем вниманию читателей неадаптированный текст повести, снабженный комментариями и словарем.",
    isLike: true,
  ),
  BookItem(
    id: "9",
    previewSrc: "assets/images/1984.png",
    name: "1984",
    author: "Джордж Оруэлл",
    year: 1949,
    genres: ["18+", "Роман", "Антиутопия", "Социальная фантастика"],
    description: "Своеобразный антипод второй великой антиутопии XX века - `О дивный новый мир` Олдоса Хаксли. Что, в сущности, страшнее: доведенное до абсурда `общество потребления` - или доведенное до абсолюта `общество идеи`? По Оруэллу, нет и не может быть ничего ужаснее тотальной несвободы...",
    isLike: true,
  ),
  BookItem(
    id: "10",
    previewSrc: "assets/images/master_and_margarita.png",
    name: "Мастер и Маргарита",
    author: "Михаил Булгаков",
    year: 1967,
    genres: ["16+", "Роман", "Проза", "Сверхъестественное"],
    description: "Москвичи 1930-х годов и свита дьявола, прокуратор Иудеи Понтий Пилат и философ Иешуа Га-Ноцри, талантливый и сумасшедший мастер и его возлюбленная Маргарита, ставшая ведьмой. Сатира на советское общество, библейский сюжет, бал сатаны. Многоуровневый и многогранный роман Михаила Булгакова уже не одно десятилетие ставит перед читателями вопросы и заставляет иначе взглянуть на самих себя.",
  ),
  BookItem(
    id: "11",
    previewSrc: "assets/images/storm.png",
    name: "Гроза",
    author: "Александр Островский",
    year: 1860,
    genres: ["12+", "Драматургия", "Классика"],
    description: "Александр Николаевич Островский (1823–1886) — знаменитый русский драматург и основоположник национального театра. «Литературе Вы принесли в дар целую библиотеку художественных произведений, для сцены создали свой особый мир. Вы один достроили здание, в основание которого положили краеугольные камни Фонвизин, Грибоедов, Гоголь», — писал о нем критик И. Гончаров. В пьесе «Гроза» А.Н. Островский изобразил жизнь купеческого города середины XIX века и личную трагедию каждого, кто осмелился противостоять «темному царству» мещанского быта. Главная героиня Катерина мечтательна и самобытна, она не способна выдержать грубое отношение к себе и страдает от несправедливых попреков вдовы Кабановой, держащей в повиновении вcю семью. Не смирившись с трудной жизнью в доме с деспотичной хозяйкой, девушка делает вызов привычным устоям. Она сильно рискует, когда решается на измену мужу с тем, кого ее сердце любит взаправду. И даже вымышленный город Калинов не может закрыть глаза на этот проступок.",
  ),
];

void main() {
  runApp(const App());
}

class App extends StatelessWidget {
  const new({super.key});

  @override
  Widget build(BuildContext context) {
    Map<String, BookItem> booksIds = Map.fromIterable(books, key: (b) => b.id);

    var catalogScreen = CatalogScreen(books: booksIds);

    return MaterialApp(
      debugShowCheckedModeBanner: true,
      theme: ThemeData(fontFamily: "Inter"),
      home: Scaffold(body: SafeArea(child: catalogScreen)),
    );
  }
}
